In [2]:
#!pip install sqlalchemy
#!pip install psycopg2 sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ystil\anaconda3\lib\site-packages (1.3.21)
Collecting psycopg2
  Downloading psycopg2-2.8.6-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [2]:
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from config import username, password

In [8]:
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/EmployeesSQL')
connection = engine.connect()

In [11]:
#to load employees table in a dataframe
edata = pd.read_sql("select * from employees e", connection)
edata.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [16]:
#join of employees and salaries
esdata = pd.read_sql('select e.emp_no, s.salary from employees e inner join salaries s on e.emp_no = s.emp_no', connection)
esdata.sort_values(by='emp_no').head(10)

        emp_no  salary
50139    10001   60117
266768   10002   65828
243267   10003   40006
275986   10004   40054
35279    10005   78228
142664   10006   40000
284868   10007   56724
114364   10008   46671
285157   10009   60929
45844    10010   72488